
                                           Задача "Исследование JVM через VisualVM" 
/*
в скобках () указаны цифры с графиков, прилагаемых к дз

скринн Classes

-- 19:42:17.976928 ("1") началось загрузка классов "io.vertx" до  19:42:18 ("2")
-Затем 3 секунды перерыв (с "3" до "4")
-- 19:42:21.964652800 ("4") началось загрузка классов "loading io.netty" до 19:42:23 ("5")
-Затем 3 секунды перерыв (с "6" до "7")
--19:42:26.463086700 ("7") началось загрузка классов "loading org.springframework" до 19:42:26.983788800("8")
-Затем перерыв 3 секунды и конец загрузки классов

скринн Heap

-- до 19:42:20 ("1") размер и использование кучи практически не изменяется, т.к. происходит только подгрузка классов с момента19:42:17.976928("1") 
до момента создания первого большого количества объектов  ("2") 19:42:29.990077600: "creating 5000000 objects".
--19:42:29.990077600 ("2") размер кучи и ее использование начинается увеличиваться, т.к.
она заполняется новосозданными объектами до окончания создания 19:42:30.595728400: "created"
- затем  перерыв 3 секунды с  19:42:30 до 19:42:33 ("3")
-- 19:42:33.608009500 ("3") в кучу добавляются еще "5000000 objects" до 19:42:34.522487100: ("4") "created"
- затем  перерыв 3 секунды с  19:42:34 ("4") до 19:42:37 ("5")
-- 19:42:37.813610 ("5") в кучу добавляются еще "creating 5000000 objects" до 19:42:38.418265700 ("6") "created"
- затем  перерыв 3 секунды с  19:42:38

cкринн Metaspace

-- в 19:41:11 до 19:42:12 ("1") началось резервирование и увеличения памяти в Metaspace
-- c 19:42:12 до 19:42:17.976928 ("2") Metaspace не изменяется,т.к. программа не выполняет никаких действий
--затем с 19:42:17.951373700 ("2") 19:42:27 ("7") идет загрузка всех классов в программе ("2->3", "4 -> 5", "6 -> 7")
с 3-х секундными перерывами("3 -> 4", "5 ->6", "7 ->8")
-- c 19:42:29.990077600 ("8") до 19:42:30.595728400 ("9") идет увеличение памяти "metaspace" 
для созданых "5_000_000" объектов, но т.к. в дальнейшем JVM знает что они нигде не будут использованы,
сборщик мусора их удаляет и поэтому с 19:42:30 ("9") "Metaspace" не увеличивает свой размер и все дальнейшие созданные объекты
так же будут удалены.

 */